zhaohuaxiaoy/folo-ai-passport-voice/sdkconfig.defaults
# --- 目标芯片 ---
CONFIG_IDF_TARGET="esp32c3"
# 注:ESP32-C3 无 PSRAM,故不设 CONFIG_SPIRAM。

# --- Flash ---
# FoloToy AI Passport 的所有硬件批次均使用 8MB Flash。
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# 烧录时按实际探测容量回写镜像头。
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y

# --- 控制台:USB-Serial-JTAG(C3 原生 USB,GPIO18/19)---
# 不用 UART0:其默认 TX=GPIO21 与本板背光引脚冲突。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- LVGL ---
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
# LVGL 内置 malloc 池大小(KB)。它是独立静态区、不与系统堆共享,配大了会白白占用 RAM。
# 本 demo UI 简单,24KB 足够;若自建复杂界面出现绘制卡死/看门狗,调大此值。
CONFIG_LV_MEM_SIZE_KILOBYTES=24

# --- 系统 ---
CONFIG_FREERTOS_HZ=1000

# --- Bluetooth LE / NimBLE(HID 键盘外设)---
# 参考 origin/demo/claude-buddy-port 已验证的 NimBLE 配置。
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=2
CONFIG_BT_NIMBLE_HOST_BASED_PRIVACY=n
CONFIG_BT_NIMBLE_UTIL_API=y
# Just Works 配对(SC 无 MITM,无需输 PIN);macOS 对 HID 键盘一般直接放行,
# 若拒绝则此配置让配对兜底(代码侧需 ble_store_config_init 持久化 bond)。
CONFIG_BT_NIMBLE_SM_LEGACY=n
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y

# --- Wi-Fi + BLE 共存(单核必须)---
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y

# --- WebSocket 缓冲 ---
# TX 须 ≥ 单块音频 3200B + 帧头,否则 send_bin 会分块(破坏 100ms 帧序)。
# RX 4096:超协议上限(2048B)的服务端行不至于直接断连,由应用层整行丢弃。
CONFIG_ESP_WEBSOCKET_CLIENT_BUFFER_SIZE_TX=4096
CONFIG_ESP_WEBSOCKET_CLIENT_BUFFER_SIZE_RX=4096

# --- LWIP:WS 1 路 + DNS 1 路 + mDNS UDP 1 路 ---
CONFIG_LWIP_MAX_SOCKETS=6
# --- Wi-Fi:关 WPA3/AMPDU 省 RAM(路由器 WPA2 即可;真用 WPA3 时再开回来)---
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=n
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
